PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.2 *
       3;* Date/Time created: Sat Oct 29 02:25:59 2016                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main_pru0.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.2 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/root/ECE497repo/hw07/PRU")
      12        .global __PRU_CREG_PRU_CFG
      13
      14$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      16        .dwattr $C$DW$1, DW_AT_declaration
      17        .dwattr $C$DW$1, DW_AT_external
      18
      19$C$DW$2 .dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
      20        .dwattr $C$DW$2, DW_AT_TI_symbol_name("__delay_cycles")

      98;*                                                             *
      99;* FUNCTION PROPERTIES                                         *
     100;*                            0 Auto,  0 SOE     *
     101;***************************************************************
     102
     103 00000000                 ||main||:
     104;* --------------------------------------------------------------------------*
     105        .dwcfi  cfa_offset, 0
     106        .dwpsn  file "main_pru0.c",line 56,column 2,is_stmt,isa 0
     107;----------------------------------------------------------------------
     108;  56 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
     109;  58 | while(1){//!(__R31&(1<<3))) {                                          
     110;----------------------------------------------------------------------
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    3

     111 00000000 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |56| CT_CFG
     112 00000004 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |56| 
     113 00000008 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |56| CT_CFG
     114;* --------------------------------------------------------------------------*
     115;*   BEGIN LOOP ||$C$L1||
     116;*
     117;*   Loop source line                : 58
     118;*   Loop closing brace source line  : 68
     119;*   Known Minimum Trip Count        : 1
     120;*   Known Maximum Trip Count        : 4294967295
     121;*   Known Max Trip Count Factor     : 1
     122;* --------------------------------------------------------------------------*
     123 0000000c                 ||$C$L1||:    
     124        .dwpsn  file "main_pru0.c",line 60,column 3,is_stmt,isa 0
     125;----------------------------------------------------------------------
     126;  60 | if(__R31&(1<<3)) {                                                     
     127;  61 |         __R30 = 1<<5;                                                  
     128;  62 | } else {                                                               
     129;----------------------------------------------------------------------
     130 0000000c 000000D103FF03          QBBS      ||$C$L2||, r31, 0x03  ; [ALU_PRU] |60| 
     131;* --------------------------------------------------------------------------*
     132        .dwpsn  file "main_pru0.c",line 63,column 4,is_stmt,isa 0
     133;----------------------------------------------------------------------
     134;  63 | __R30 = 0;                                                             
     135;----------------------------------------------------------------------
     136 00000010 0000002EFF819E          ZERO      &r30, 4               ; [ALU_PRU] |63| 
     137 00000014 00000021000000!         JMP       ||$C$L3||             ; [ALU_PRU] |63| 
     138;* --------------------------------------------------------------------------*
     139 00000018                 ||$C$L2||:    
     140        .dwpsn  file "main_pru0.c",line 61,column 4,is_stmt,isa 0
     141 00000018 000000240020FE          LDI       r30, 0x0020           ; [ALU_PRU] |61| 
     142;* --------------------------------------------------------------------------*
     143 0000001c                 ||$C$L3||:    
     144        .dwpsn  file "main_pru0.c",line 65,column 3,is_stmt,isa 0
     145;----------------------------------------------------------------------
     146;  65 | __delay_cycles(TIME);                                                  
     147;  66 | // __R30 &= ~(1<<5);                                                   
     148;  67 | // __delay_cycles(TIME);                                               
     149;  69 | __delay_cycles(TIME);   // Give some time for press to release         
     150;  70 | // Call assembly language                                              
     151;  71 | start(TIME);                                                           
     152;  72 | __halt();                                                              
     153;----------------------------------------------------------------------
     154        .newblock
     155 0000001c 259F80240026C0          LDI32    r0, 2499999
     156 00000024 0000000501E0E0  $1:     SUB      r0, r0, 1
     157 00000028 0000006F00E0FF          QBNE     $1, r0, 0             ; [ALU_PRU] |65| 
     158        .dwpsn  file "main_pru0.c",line 58,column 8,is_stmt,isa 0
     159 0000002c 00000021000000!         JMP       ||$C$L1||             ; [ALU_PRU] |58| 
     160;* --------------------------------------------------------------------------*
     161        .dwattr $C$DW$8, DW_AT_TI_end_file("main_pru0.c")
     162        .dwattr $C$DW$8, DW_AT_TI_end_line(0x49)
     163        .dwattr $C$DW$8, DW_AT_TI_end_column(0x01)
     164        .dwendentry
     165        .dwendtag $C$DW$8
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    4

     166
     167
     168;******************************************************************************
     169;* TYPE INFORMATION                                                           *
     170;******************************************************************************
     171
     172$C$DW$T$19      .dwtag  DW_TAG_structure_type
     173        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     174$C$DW$9 .dwtag  DW_TAG_member
     175        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     176        .dwattr $C$DW$9, DW_AT_name("REVID")
     177        .dwattr $C$DW$9, DW_AT_TI_symbol_name("REVID")
     178        .dwattr $C$DW$9, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     179        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     180        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     181        .dwattr $C$DW$9, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     182        .dwattr $C$DW$9, DW_AT_decl_line(0x2d)
     183        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     184        .dwendtag $C$DW$T$19
     185
     186        .dwattr $C$DW$T$19, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     187        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     188        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     189$C$DW$T$37      .dwtag  DW_TAG_volatile_type
     190        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
     191
     192$C$DW$T$20      .dwtag  DW_TAG_structure_type
     193        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     194$C$DW$10        .dwtag  DW_TAG_member
     195        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     196        .dwattr $C$DW$10, DW_AT_name("IDLE_MODE")
     197        .dwattr $C$DW$10, DW_AT_TI_symbol_name("IDLE_MODE")
     198        .dwattr $C$DW$10, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     199        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     200        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     201        .dwattr $C$DW$10, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     202        .dwattr $C$DW$10, DW_AT_decl_line(0x37)
     203        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     204$C$DW$11        .dwtag  DW_TAG_member
     205        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     206        .dwattr $C$DW$11, DW_AT_name("STANDBY_MODE")
     207        .dwattr $C$DW$11, DW_AT_TI_symbol_name("STANDBY_MODE")
     208        .dwattr $C$DW$11, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     209        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     210        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     211        .dwattr $C$DW$11, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     212        .dwattr $C$DW$11, DW_AT_decl_line(0x38)
     213        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     214$C$DW$12        .dwtag  DW_TAG_member
     215        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     216        .dwattr $C$DW$12, DW_AT_name("STANDBY_INIT")
     217        .dwattr $C$DW$12, DW_AT_TI_symbol_name("STANDBY_INIT")
     218        .dwattr $C$DW$12, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     219        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     220        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    5

     221        .dwattr $C$DW$12, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     222        .dwattr $C$DW$12, DW_AT_decl_line(0x39)
     223        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     224$C$DW$13        .dwtag  DW_TAG_member
     225        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     226        .dwattr $C$DW$13, DW_AT_name("SUB_MWAIT")
     227        .dwattr $C$DW$13, DW_AT_TI_symbol_name("SUB_MWAIT")
     228        .dwattr $C$DW$13, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     229        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     230        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     231        .dwattr $C$DW$13, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     232        .dwattr $C$DW$13, DW_AT_decl_line(0x3a)
     233        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     234$C$DW$14        .dwtag  DW_TAG_member
     235        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     236        .dwattr $C$DW$14, DW_AT_name("rsvd6")
     237        .dwattr $C$DW$14, DW_AT_TI_symbol_name("rsvd6")
     238        .dwattr $C$DW$14, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     239        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     240        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     241        .dwattr $C$DW$14, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     242        .dwattr $C$DW$14, DW_AT_decl_line(0x3b)
     243        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     244        .dwendtag $C$DW$T$20
     245
     246        .dwattr $C$DW$T$20, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     247        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     248        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     249$C$DW$T$39      .dwtag  DW_TAG_volatile_type
     250        .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
     251
     252$C$DW$T$21      .dwtag  DW_TAG_structure_type
     253        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     254$C$DW$15        .dwtag  DW_TAG_member
     255        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     256        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_MODE")
     257        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     258        .dwattr $C$DW$15, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     259        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     260        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     261        .dwattr $C$DW$15, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     262        .dwattr $C$DW$15, DW_AT_decl_line(0x45)
     263        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     264$C$DW$16        .dwtag  DW_TAG_member
     265        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     266        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_CLK_MODE")
     267        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     268        .dwattr $C$DW$16, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     269        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     270        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     271        .dwattr $C$DW$16, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     272        .dwattr $C$DW$16, DW_AT_decl_line(0x46)
     273        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     274$C$DW$17        .dwtag  DW_TAG_member
     275        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    6

     276        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_DIV0")
     277        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     278        .dwattr $C$DW$17, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     279        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     280        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     281        .dwattr $C$DW$17, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     282        .dwattr $C$DW$17, DW_AT_decl_line(0x47)
     283        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     284$C$DW$18        .dwtag  DW_TAG_member
     285        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     286        .dwattr $C$DW$18, DW_AT_name("PRU0_GPI_DIV1")
     287        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     288        .dwattr $C$DW$18, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     289        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     290        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     291        .dwattr $C$DW$18, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     292        .dwattr $C$DW$18, DW_AT_decl_line(0x48)
     293        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     294$C$DW$19        .dwtag  DW_TAG_member
     295        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     296        .dwattr $C$DW$19, DW_AT_name("PRU0_GPI_SB")
     297        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     298        .dwattr $C$DW$19, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     299        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     300        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     301        .dwattr $C$DW$19, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     302        .dwattr $C$DW$19, DW_AT_decl_line(0x49)
     303        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     304$C$DW$20        .dwtag  DW_TAG_member
     305        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     306        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_MODE")
     307        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     308        .dwattr $C$DW$20, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     309        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     310        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     311        .dwattr $C$DW$20, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     312        .dwattr $C$DW$20, DW_AT_decl_line(0x4a)
     313        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     314$C$DW$21        .dwtag  DW_TAG_member
     315        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     316        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_DIV0")
     317        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     318        .dwattr $C$DW$21, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     319        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     320        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     321        .dwattr $C$DW$21, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     322        .dwattr $C$DW$21, DW_AT_decl_line(0x4b)
     323        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     324$C$DW$22        .dwtag  DW_TAG_member
     325        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     326        .dwattr $C$DW$22, DW_AT_name("PRU0_GPO_DIV1")
     327        .dwattr $C$DW$22, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     328        .dwattr $C$DW$22, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     329        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     330        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    7

     331        .dwattr $C$DW$22, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     332        .dwattr $C$DW$22, DW_AT_decl_line(0x4c)
     333        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     334$C$DW$23        .dwtag  DW_TAG_member
     335        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     336        .dwattr $C$DW$23, DW_AT_name("PRU0_GPO_SH_SEL")
     337        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     338        .dwattr $C$DW$23, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     339        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     341        .dwattr $C$DW$23, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     342        .dwattr $C$DW$23, DW_AT_decl_line(0x4d)
     343        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     344$C$DW$24        .dwtag  DW_TAG_member
     345        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     346        .dwattr $C$DW$24, DW_AT_name("rsvd26")
     347        .dwattr $C$DW$24, DW_AT_TI_symbol_name("rsvd26")
     348        .dwattr $C$DW$24, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     349        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     350        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     351        .dwattr $C$DW$24, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     352        .dwattr $C$DW$24, DW_AT_decl_line(0x4e)
     353        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     354        .dwendtag $C$DW$T$21
     355
     356        .dwattr $C$DW$T$21, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     357        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     358        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     359$C$DW$T$41      .dwtag  DW_TAG_volatile_type
     360        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
     361
     362$C$DW$T$22      .dwtag  DW_TAG_structure_type
     363        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     364$C$DW$25        .dwtag  DW_TAG_member
     365        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     366        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_MODE")
     367        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     368        .dwattr $C$DW$25, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     369        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     370        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     371        .dwattr $C$DW$25, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     372        .dwattr $C$DW$25, DW_AT_decl_line(0x58)
     373        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     374$C$DW$26        .dwtag  DW_TAG_member
     375        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     376        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_CLK_MODE")
     377        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     378        .dwattr $C$DW$26, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     379        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     380        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     381        .dwattr $C$DW$26, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     382        .dwattr $C$DW$26, DW_AT_decl_line(0x59)
     383        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     384$C$DW$27        .dwtag  DW_TAG_member
     385        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    8

     386        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_DIV0")
     387        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     388        .dwattr $C$DW$27, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     389        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     390        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     391        .dwattr $C$DW$27, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     392        .dwattr $C$DW$27, DW_AT_decl_line(0x5a)
     393        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     394$C$DW$28        .dwtag  DW_TAG_member
     395        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     396        .dwattr $C$DW$28, DW_AT_name("PRU1_GPI_DIV1")
     397        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     398        .dwattr $C$DW$28, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     399        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     400        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     401        .dwattr $C$DW$28, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     402        .dwattr $C$DW$28, DW_AT_decl_line(0x5b)
     403        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     404$C$DW$29        .dwtag  DW_TAG_member
     405        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     406        .dwattr $C$DW$29, DW_AT_name("PRU1_GPI_SB")
     407        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     408        .dwattr $C$DW$29, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     409        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     410        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     411        .dwattr $C$DW$29, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     412        .dwattr $C$DW$29, DW_AT_decl_line(0x5c)
     413        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     414$C$DW$30        .dwtag  DW_TAG_member
     415        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     416        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_MODE")
     417        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     418        .dwattr $C$DW$30, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     419        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     420        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     421        .dwattr $C$DW$30, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     422        .dwattr $C$DW$30, DW_AT_decl_line(0x5d)
     423        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     424$C$DW$31        .dwtag  DW_TAG_member
     425        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     426        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_DIV0")
     427        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     428        .dwattr $C$DW$31, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     429        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     430        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     431        .dwattr $C$DW$31, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     432        .dwattr $C$DW$31, DW_AT_decl_line(0x5e)
     433        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     434$C$DW$32        .dwtag  DW_TAG_member
     435        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     436        .dwattr $C$DW$32, DW_AT_name("PRU1_GPO_DIV1")
     437        .dwattr $C$DW$32, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     438        .dwattr $C$DW$32, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     439        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     440        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    9

     441        .dwattr $C$DW$32, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     442        .dwattr $C$DW$32, DW_AT_decl_line(0x5f)
     443        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     444$C$DW$33        .dwtag  DW_TAG_member
     445        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     446        .dwattr $C$DW$33, DW_AT_name("PRU1_GPO_SH_SEL")
     447        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     448        .dwattr $C$DW$33, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     449        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     451        .dwattr $C$DW$33, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     452        .dwattr $C$DW$33, DW_AT_decl_line(0x60)
     453        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     454$C$DW$34        .dwtag  DW_TAG_member
     455        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     456        .dwattr $C$DW$34, DW_AT_name("rsvd26")
     457        .dwattr $C$DW$34, DW_AT_TI_symbol_name("rsvd26")
     458        .dwattr $C$DW$34, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     459        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     460        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     461        .dwattr $C$DW$34, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     462        .dwattr $C$DW$34, DW_AT_decl_line(0x61)
     463        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     464        .dwendtag $C$DW$T$22
     465
     466        .dwattr $C$DW$T$22, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     467        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     468        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     469$C$DW$T$43      .dwtag  DW_TAG_volatile_type
     470        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$22)
     471
     472$C$DW$T$23      .dwtag  DW_TAG_structure_type
     473        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     474$C$DW$35        .dwtag  DW_TAG_member
     475        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     476        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_STOP_REQ")
     477        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     478        .dwattr $C$DW$35, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     479        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     480        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     481        .dwattr $C$DW$35, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     482        .dwattr $C$DW$35, DW_AT_decl_line(0x6b)
     483        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     484$C$DW$36        .dwtag  DW_TAG_member
     485        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     486        .dwattr $C$DW$36, DW_AT_name("PRU0_CLK_STOP_ACK")
     487        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     488        .dwattr $C$DW$36, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     489        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     490        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     491        .dwattr $C$DW$36, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     492        .dwattr $C$DW$36, DW_AT_decl_line(0x6c)
     493        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     494$C$DW$37        .dwtag  DW_TAG_member
     495        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   10

     496        .dwattr $C$DW$37, DW_AT_name("PRU0_CLK_EN")
     497        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     498        .dwattr $C$DW$37, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     499        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     500        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     501        .dwattr $C$DW$37, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     502        .dwattr $C$DW$37, DW_AT_decl_line(0x6d)
     503        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     504$C$DW$38        .dwtag  DW_TAG_member
     505        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     506        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_STOP_REQ")
     507        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     508        .dwattr $C$DW$38, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     509        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     510        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     511        .dwattr $C$DW$38, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     512        .dwattr $C$DW$38, DW_AT_decl_line(0x6e)
     513        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     514$C$DW$39        .dwtag  DW_TAG_member
     515        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     516        .dwattr $C$DW$39, DW_AT_name("PRU1_CLK_STOP_ACK")
     517        .dwattr $C$DW$39, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     518        .dwattr $C$DW$39, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     519        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     520        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     521        .dwattr $C$DW$39, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     522        .dwattr $C$DW$39, DW_AT_decl_line(0x6f)
     523        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     524$C$DW$40        .dwtag  DW_TAG_member
     525        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     526        .dwattr $C$DW$40, DW_AT_name("PRU1_CLK_EN")
     527        .dwattr $C$DW$40, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     528        .dwattr $C$DW$40, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     529        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     530        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     531        .dwattr $C$DW$40, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     532        .dwattr $C$DW$40, DW_AT_decl_line(0x70)
     533        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     534$C$DW$41        .dwtag  DW_TAG_member
     535        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     536        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_STOP_REQ")
     537        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     538        .dwattr $C$DW$41, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     539        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     540        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     541        .dwattr $C$DW$41, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     542        .dwattr $C$DW$41, DW_AT_decl_line(0x71)
     543        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     544$C$DW$42        .dwtag  DW_TAG_member
     545        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     546        .dwattr $C$DW$42, DW_AT_name("INTC_CLK_STOP_ACK")
     547        .dwattr $C$DW$42, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     548        .dwattr $C$DW$42, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     549        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   11

     551        .dwattr $C$DW$42, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     552        .dwattr $C$DW$42, DW_AT_decl_line(0x72)
     553        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     554$C$DW$43        .dwtag  DW_TAG_member
     555        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     556        .dwattr $C$DW$43, DW_AT_name("INTC_CLK_EN")
     557        .dwattr $C$DW$43, DW_AT_TI_symbol_name("INTC_CLK_EN")
     558        .dwattr $C$DW$43, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     559        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     560        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     561        .dwattr $C$DW$43, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     562        .dwattr $C$DW$43, DW_AT_decl_line(0x73)
     563        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     564$C$DW$44        .dwtag  DW_TAG_member
     565        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     566        .dwattr $C$DW$44, DW_AT_name("UART_CLK_STOP_REQ")
     567        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     568        .dwattr $C$DW$44, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     569        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     570        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     571        .dwattr $C$DW$44, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     572        .dwattr $C$DW$44, DW_AT_decl_line(0x74)
     573        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     574$C$DW$45        .dwtag  DW_TAG_member
     575        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     576        .dwattr $C$DW$45, DW_AT_name("UART_CLK_STOP_ACK")
     577        .dwattr $C$DW$45, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     578        .dwattr $C$DW$45, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     579        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     580        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     581        .dwattr $C$DW$45, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     582        .dwattr $C$DW$45, DW_AT_decl_line(0x75)
     583        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     584$C$DW$46        .dwtag  DW_TAG_member
     585        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     586        .dwattr $C$DW$46, DW_AT_name("UART_CLK_EN")
     587        .dwattr $C$DW$46, DW_AT_TI_symbol_name("UART_CLK_EN")
     588        .dwattr $C$DW$46, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     589        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     591        .dwattr $C$DW$46, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     592        .dwattr $C$DW$46, DW_AT_decl_line(0x76)
     593        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     594$C$DW$47        .dwtag  DW_TAG_member
     595        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     596        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_STOP_REQ")
     597        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     598        .dwattr $C$DW$47, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     599        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     600        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     601        .dwattr $C$DW$47, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     602        .dwattr $C$DW$47, DW_AT_decl_line(0x77)
     603        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     604$C$DW$48        .dwtag  DW_TAG_member
     605        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   12

     606        .dwattr $C$DW$48, DW_AT_name("ECAP_CLK_STOP_ACK")
     607        .dwattr $C$DW$48, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     608        .dwattr $C$DW$48, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     609        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     610        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     611        .dwattr $C$DW$48, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     612        .dwattr $C$DW$48, DW_AT_decl_line(0x78)
     613        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     614$C$DW$49        .dwtag  DW_TAG_member
     615        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     616        .dwattr $C$DW$49, DW_AT_name("ECAP_CLK_EN")
     617        .dwattr $C$DW$49, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     618        .dwattr $C$DW$49, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     619        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     620        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     621        .dwattr $C$DW$49, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     622        .dwattr $C$DW$49, DW_AT_decl_line(0x79)
     623        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     624$C$DW$50        .dwtag  DW_TAG_member
     625        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     626        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_STOP_REQ")
     627        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     628        .dwattr $C$DW$50, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     629        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     631        .dwattr $C$DW$50, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     632        .dwattr $C$DW$50, DW_AT_decl_line(0x7a)
     633        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     634$C$DW$51        .dwtag  DW_TAG_member
     635        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     636        .dwattr $C$DW$51, DW_AT_name("IEP_CLK_STOP_ACK")
     637        .dwattr $C$DW$51, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     638        .dwattr $C$DW$51, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     639        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     640        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     641        .dwattr $C$DW$51, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     642        .dwattr $C$DW$51, DW_AT_decl_line(0x7b)
     643        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     644$C$DW$52        .dwtag  DW_TAG_member
     645        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     646        .dwattr $C$DW$52, DW_AT_name("IEP_CLK_EN")
     647        .dwattr $C$DW$52, DW_AT_TI_symbol_name("IEP_CLK_EN")
     648        .dwattr $C$DW$52, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     649        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     650        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     651        .dwattr $C$DW$52, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     652        .dwattr $C$DW$52, DW_AT_decl_line(0x7c)
     653        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     654$C$DW$53        .dwtag  DW_TAG_member
     655        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     656        .dwattr $C$DW$53, DW_AT_name("rsvd18")
     657        .dwattr $C$DW$53, DW_AT_TI_symbol_name("rsvd18")
     658        .dwattr $C$DW$53, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     659        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   13

     661        .dwattr $C$DW$53, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     662        .dwattr $C$DW$53, DW_AT_decl_line(0x7d)
     663        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     664        .dwendtag $C$DW$T$23
     665
     666        .dwattr $C$DW$T$23, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     667        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     668        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     669$C$DW$T$45      .dwtag  DW_TAG_volatile_type
     670        .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
     671
     672$C$DW$T$24      .dwtag  DW_TAG_structure_type
     673        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     674$C$DW$54        .dwtag  DW_TAG_member
     675        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     676        .dwattr $C$DW$54, DW_AT_name("PRU0_IMEM_PE_RAW")
     677        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     678        .dwattr $C$DW$54, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     679        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     680        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     681        .dwattr $C$DW$54, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     682        .dwattr $C$DW$54, DW_AT_decl_line(0x87)
     683        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     684$C$DW$55        .dwtag  DW_TAG_member
     685        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     686        .dwattr $C$DW$55, DW_AT_name("PRU0_DMEM_PE_RAW")
     687        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     688        .dwattr $C$DW$55, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     689        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     691        .dwattr $C$DW$55, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     692        .dwattr $C$DW$55, DW_AT_decl_line(0x88)
     693        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     694$C$DW$56        .dwtag  DW_TAG_member
     695        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     696        .dwattr $C$DW$56, DW_AT_name("PRU1_IMEM_PE_RAW")
     697        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     698        .dwattr $C$DW$56, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     699        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     700        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     701        .dwattr $C$DW$56, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     702        .dwattr $C$DW$56, DW_AT_decl_line(0x89)
     703        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     704$C$DW$57        .dwtag  DW_TAG_member
     705        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     706        .dwattr $C$DW$57, DW_AT_name("PRU1_DMEM_PE_RAW")
     707        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     708        .dwattr $C$DW$57, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     709        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     711        .dwattr $C$DW$57, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     712        .dwattr $C$DW$57, DW_AT_decl_line(0x8a)
     713        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     714$C$DW$58        .dwtag  DW_TAG_member
     715        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   14

     716        .dwattr $C$DW$58, DW_AT_name("RAM_PE_RAW")
     717        .dwattr $C$DW$58, DW_AT_TI_symbol_name("RAM_PE_RAW")
     718        .dwattr $C$DW$58, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     719        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     720        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     721        .dwattr $C$DW$58, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     722        .dwattr $C$DW$58, DW_AT_decl_line(0x8b)
     723        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     724$C$DW$59        .dwtag  DW_TAG_member
     725        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     726        .dwattr $C$DW$59, DW_AT_name("rsvd20")
     727        .dwattr $C$DW$59, DW_AT_TI_symbol_name("rsvd20")
     728        .dwattr $C$DW$59, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     729        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     731        .dwattr $C$DW$59, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     732        .dwattr $C$DW$59, DW_AT_decl_line(0x8c)
     733        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     734        .dwendtag $C$DW$T$24
     735
     736        .dwattr $C$DW$T$24, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     737        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     738        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     739$C$DW$T$47      .dwtag  DW_TAG_volatile_type
     740        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
     741
     742$C$DW$T$25      .dwtag  DW_TAG_structure_type
     743        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     744$C$DW$60        .dwtag  DW_TAG_member
     745        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     746        .dwattr $C$DW$60, DW_AT_name("PRU0_IMEM_PE")
     747        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     748        .dwattr $C$DW$60, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     749        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     751        .dwattr $C$DW$60, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     752        .dwattr $C$DW$60, DW_AT_decl_line(0x96)
     753        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     754$C$DW$61        .dwtag  DW_TAG_member
     755        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     756        .dwattr $C$DW$61, DW_AT_name("PRU0_DMEM_PE")
     757        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     758        .dwattr $C$DW$61, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     759        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     760        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     761        .dwattr $C$DW$61, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     762        .dwattr $C$DW$61, DW_AT_decl_line(0x97)
     763        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     764$C$DW$62        .dwtag  DW_TAG_member
     765        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     766        .dwattr $C$DW$62, DW_AT_name("PRU1_IMEM_PE")
     767        .dwattr $C$DW$62, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     768        .dwattr $C$DW$62, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     769        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   15

     771        .dwattr $C$DW$62, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     772        .dwattr $C$DW$62, DW_AT_decl_line(0x98)
     773        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     774$C$DW$63        .dwtag  DW_TAG_member
     775        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     776        .dwattr $C$DW$63, DW_AT_name("PRU1_DMEM_PE")
     777        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     778        .dwattr $C$DW$63, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     779        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     780        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     781        .dwattr $C$DW$63, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     782        .dwattr $C$DW$63, DW_AT_decl_line(0x99)
     783        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     784$C$DW$64        .dwtag  DW_TAG_member
     785        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     786        .dwattr $C$DW$64, DW_AT_name("RAM_PE")
     787        .dwattr $C$DW$64, DW_AT_TI_symbol_name("RAM_PE")
     788        .dwattr $C$DW$64, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     789        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     791        .dwattr $C$DW$64, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     792        .dwattr $C$DW$64, DW_AT_decl_line(0x9a)
     793        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     794$C$DW$65        .dwtag  DW_TAG_member
     795        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     796        .dwattr $C$DW$65, DW_AT_name("rsvd20")
     797        .dwattr $C$DW$65, DW_AT_TI_symbol_name("rsvd20")
     798        .dwattr $C$DW$65, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     799        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     800        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     801        .dwattr $C$DW$65, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     802        .dwattr $C$DW$65, DW_AT_decl_line(0x9b)
     803        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     804        .dwendtag $C$DW$T$25
     805
     806        .dwattr $C$DW$T$25, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     807        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     808        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     809$C$DW$T$49      .dwtag  DW_TAG_volatile_type
     810        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
     811
     812$C$DW$T$26      .dwtag  DW_TAG_structure_type
     813        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     814$C$DW$66        .dwtag  DW_TAG_member
     815        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     816        .dwattr $C$DW$66, DW_AT_name("PRU0_IMEM_PE_SET")
     817        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     818        .dwattr $C$DW$66, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     819        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     820        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     821        .dwattr $C$DW$66, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     822        .dwattr $C$DW$66, DW_AT_decl_line(0xa4)
     823        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     824$C$DW$67        .dwtag  DW_TAG_member
     825        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   16

     826        .dwattr $C$DW$67, DW_AT_name("PRU0_DMEM_PE_SET")
     827        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     828        .dwattr $C$DW$67, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     829        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     830        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     831        .dwattr $C$DW$67, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     832        .dwattr $C$DW$67, DW_AT_decl_line(0xa5)
     833        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     834$C$DW$68        .dwtag  DW_TAG_member
     835        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     836        .dwattr $C$DW$68, DW_AT_name("PRU1_IMEM_PE_SET")
     837        .dwattr $C$DW$68, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     838        .dwattr $C$DW$68, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     839        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     840        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     841        .dwattr $C$DW$68, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     842        .dwattr $C$DW$68, DW_AT_decl_line(0xa6)
     843        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     844$C$DW$69        .dwtag  DW_TAG_member
     845        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     846        .dwattr $C$DW$69, DW_AT_name("PRU1_DMEM_PE_SET")
     847        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     848        .dwattr $C$DW$69, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     849        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     851        .dwattr $C$DW$69, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     852        .dwattr $C$DW$69, DW_AT_decl_line(0xa7)
     853        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     854$C$DW$70        .dwtag  DW_TAG_member
     855        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     856        .dwattr $C$DW$70, DW_AT_name("RAM_PE_SET")
     857        .dwattr $C$DW$70, DW_AT_TI_symbol_name("RAM_PE_SET")
     858        .dwattr $C$DW$70, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     859        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     860        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     861        .dwattr $C$DW$70, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     862        .dwattr $C$DW$70, DW_AT_decl_line(0xa8)
     863        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     864$C$DW$71        .dwtag  DW_TAG_member
     865        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     866        .dwattr $C$DW$71, DW_AT_name("rsvd20")
     867        .dwattr $C$DW$71, DW_AT_TI_symbol_name("rsvd20")
     868        .dwattr $C$DW$71, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     869        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     870        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     871        .dwattr $C$DW$71, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     872        .dwattr $C$DW$71, DW_AT_decl_line(0xa9)
     873        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     874        .dwendtag $C$DW$T$26
     875
     876        .dwattr $C$DW$T$26, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     877        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     878        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     879$C$DW$T$51      .dwtag  DW_TAG_volatile_type
     880        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   17

     881
     882$C$DW$T$27      .dwtag  DW_TAG_structure_type
     883        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     884$C$DW$72        .dwtag  DW_TAG_member
     885        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     886        .dwattr $C$DW$72, DW_AT_name("PRU0_IMEM_PE_CLR")
     887        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     888        .dwattr $C$DW$72, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     889        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     890        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     891        .dwattr $C$DW$72, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     892        .dwattr $C$DW$72, DW_AT_decl_line(0xb3)
     893        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     894$C$DW$73        .dwtag  DW_TAG_member
     895        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     896        .dwattr $C$DW$73, DW_AT_name("PRU0_DMEM_PE_CLR")
     897        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
     898        .dwattr $C$DW$73, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     899        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     901        .dwattr $C$DW$73, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     902        .dwattr $C$DW$73, DW_AT_decl_line(0xb4)
     903        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     904$C$DW$74        .dwtag  DW_TAG_member
     905        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     906        .dwattr $C$DW$74, DW_AT_name("PRU1_IMEM_PE_CLR")
     907        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
     908        .dwattr $C$DW$74, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     909        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     910        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     911        .dwattr $C$DW$74, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     912        .dwattr $C$DW$74, DW_AT_decl_line(0xb5)
     913        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     914$C$DW$75        .dwtag  DW_TAG_member
     915        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     916        .dwattr $C$DW$75, DW_AT_name("PRU1_DMEM_PE_CLR")
     917        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
     918        .dwattr $C$DW$75, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     919        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     921        .dwattr $C$DW$75, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     922        .dwattr $C$DW$75, DW_AT_decl_line(0xb6)
     923        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     924$C$DW$76        .dwtag  DW_TAG_member
     925        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     926        .dwattr $C$DW$76, DW_AT_name("rsvd16")
     927        .dwattr $C$DW$76, DW_AT_TI_symbol_name("rsvd16")
     928        .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     929        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     931        .dwattr $C$DW$76, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     932        .dwattr $C$DW$76, DW_AT_decl_line(0xb7)
     933        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
     934        .dwendtag $C$DW$T$27
     935
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   18

     936        .dwattr $C$DW$T$27, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     937        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
     938        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     939$C$DW$T$53      .dwtag  DW_TAG_volatile_type
     940        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
     941
     942$C$DW$T$28      .dwtag  DW_TAG_structure_type
     943        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     944$C$DW$77        .dwtag  DW_TAG_member
     945        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     946        .dwattr $C$DW$77, DW_AT_name("PMAO_PRU0")
     947        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PMAO_PRU0")
     948        .dwattr $C$DW$77, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     949        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     950        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     951        .dwattr $C$DW$77, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     952        .dwattr $C$DW$77, DW_AT_decl_line(0xc4)
     953        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     954$C$DW$78        .dwtag  DW_TAG_member
     955        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
     956        .dwattr $C$DW$78, DW_AT_name("PMAO_PRU1")
     957        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PMAO_PRU1")
     958        .dwattr $C$DW$78, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     959        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     961        .dwattr $C$DW$78, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     962        .dwattr $C$DW$78, DW_AT_decl_line(0xc5)
     963        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
     964$C$DW$79        .dwtag  DW_TAG_member
     965        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
     966        .dwattr $C$DW$79, DW_AT_name("rsvd2")
     967        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd2")
     968        .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
     969        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     971        .dwattr $C$DW$79, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     972        .dwattr $C$DW$79, DW_AT_decl_line(0xc6)
     973        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
     974        .dwendtag $C$DW$T$28
     975
     976        .dwattr $C$DW$T$28, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     977        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
     978        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
     979$C$DW$T$55      .dwtag  DW_TAG_volatile_type
     980        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$28)
     981
     982$C$DW$T$29      .dwtag  DW_TAG_structure_type
     983        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     984$C$DW$80        .dwtag  DW_TAG_member
     985        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
     986        .dwattr $C$DW$80, DW_AT_name("OCP_EN")
     987        .dwattr $C$DW$80, DW_AT_TI_symbol_name("OCP_EN")
     988        .dwattr $C$DW$80, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     989        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   19

     991        .dwattr $C$DW$80, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     992        .dwattr $C$DW$80, DW_AT_decl_line(0xd3)
     993        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
     994$C$DW$81        .dwtag  DW_TAG_member
     995        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
     996        .dwattr $C$DW$81, DW_AT_name("rsvd1")
     997        .dwattr $C$DW$81, DW_AT_TI_symbol_name("rsvd1")
     998        .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
     999        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1000        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1001        .dwattr $C$DW$81, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1002        .dwattr $C$DW$81, DW_AT_decl_line(0xd4)
    1003        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1004        .dwendtag $C$DW$T$29
    1005
    1006        .dwattr $C$DW$T$29, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1007        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1008        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1009$C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1010        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$29)
    1011
    1012$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1013        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1014$C$DW$82        .dwtag  DW_TAG_member
    1015        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1016        .dwattr $C$DW$82, DW_AT_name("PRU1_PAD_HP_EN")
    1017        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1018        .dwattr $C$DW$82, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1019        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1021        .dwattr $C$DW$82, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1022        .dwattr $C$DW$82, DW_AT_decl_line(0xde)
    1023        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1024$C$DW$83        .dwtag  DW_TAG_member
    1025        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1026        .dwattr $C$DW$83, DW_AT_name("XFR_SHIFT_EN")
    1027        .dwattr $C$DW$83, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1028        .dwattr $C$DW$83, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1029        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1031        .dwattr $C$DW$83, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1032        .dwattr $C$DW$83, DW_AT_decl_line(0xdf)
    1033        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1034$C$DW$84        .dwtag  DW_TAG_member
    1035        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1036        .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1037        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1038        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1039        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1040        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1041        .dwattr $C$DW$84, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1042        .dwattr $C$DW$84, DW_AT_decl_line(0xe0)
    1043        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1044        .dwendtag $C$DW$T$30
    1045
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   20

    1046        .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1047        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1048        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1049$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1050        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1051
    1052$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1053        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1054$C$DW$85        .dwtag  DW_TAG_member
    1055        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1056        .dwattr $C$DW$85, DW_AT_name("PIN_MUX_SEL")
    1057        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1058        .dwattr $C$DW$85, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1059        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1061        .dwattr $C$DW$85, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1062        .dwattr $C$DW$85, DW_AT_decl_line(0xec)
    1063        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1064$C$DW$86        .dwtag  DW_TAG_member
    1065        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1066        .dwattr $C$DW$86, DW_AT_name("rsvd2")
    1067        .dwattr $C$DW$86, DW_AT_TI_symbol_name("rsvd2")
    1068        .dwattr $C$DW$86, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1069        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1071        .dwattr $C$DW$86, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1072        .dwattr $C$DW$86, DW_AT_decl_line(0xed)
    1073        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1074        .dwendtag $C$DW$T$31
    1075
    1076        .dwattr $C$DW$T$31, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1077        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1078        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1079$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1080        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$31)
    1081
    1082$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1083        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1084$C$DW$87        .dwtag  DW_TAG_member
    1085        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$38)
    1086        .dwattr $C$DW$87, DW_AT_name("$P$T0")
    1087        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T0")
    1088        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1090        .dwattr $C$DW$87, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1091        .dwattr $C$DW$87, DW_AT_decl_line(0x29)
    1092        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1093$C$DW$88        .dwtag  DW_TAG_member
    1094        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$40)
    1095        .dwattr $C$DW$88, DW_AT_name("$P$T1")
    1096        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T1")
    1097        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1098        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1099        .dwattr $C$DW$88, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1100        .dwattr $C$DW$88, DW_AT_decl_line(0x33)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   21

    1101        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1102$C$DW$89        .dwtag  DW_TAG_member
    1103        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$42)
    1104        .dwattr $C$DW$89, DW_AT_name("$P$T2")
    1105        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T2")
    1106        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1107        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1108        .dwattr $C$DW$89, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1109        .dwattr $C$DW$89, DW_AT_decl_line(0x41)
    1110        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1111$C$DW$90        .dwtag  DW_TAG_member
    1112        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$44)
    1113        .dwattr $C$DW$90, DW_AT_name("$P$T3")
    1114        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T3")
    1115        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1116        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1117        .dwattr $C$DW$90, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1118        .dwattr $C$DW$90, DW_AT_decl_line(0x54)
    1119        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1120$C$DW$91        .dwtag  DW_TAG_member
    1121        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$46)
    1122        .dwattr $C$DW$91, DW_AT_name("$P$T4")
    1123        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T4")
    1124        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1125        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1126        .dwattr $C$DW$91, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1127        .dwattr $C$DW$91, DW_AT_decl_line(0x67)
    1128        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1129$C$DW$92        .dwtag  DW_TAG_member
    1130        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$48)
    1131        .dwattr $C$DW$92, DW_AT_name("$P$T5")
    1132        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T5")
    1133        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1134        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1135        .dwattr $C$DW$92, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1136        .dwattr $C$DW$92, DW_AT_decl_line(0x83)
    1137        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1138$C$DW$93        .dwtag  DW_TAG_member
    1139        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$50)
    1140        .dwattr $C$DW$93, DW_AT_name("$P$T6")
    1141        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T6")
    1142        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1143        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1144        .dwattr $C$DW$93, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1145        .dwattr $C$DW$93, DW_AT_decl_line(0x92)
    1146        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1147$C$DW$94        .dwtag  DW_TAG_member
    1148        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$52)
    1149        .dwattr $C$DW$94, DW_AT_name("$P$T7")
    1150        .dwattr $C$DW$94, DW_AT_TI_symbol_name("$P$T7")
    1151        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1152        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1153        .dwattr $C$DW$94, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1154        .dwattr $C$DW$94, DW_AT_decl_line(0xa0)
    1155        .dwattr $C$DW$94, DW_AT_decl_column(0x02)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   22

    1156$C$DW$95        .dwtag  DW_TAG_member
    1157        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$54)
    1158        .dwattr $C$DW$95, DW_AT_name("$P$T8")
    1159        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T8")
    1160        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1161        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1162        .dwattr $C$DW$95, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1163        .dwattr $C$DW$95, DW_AT_decl_line(0xaf)
    1164        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1165$C$DW$96        .dwtag  DW_TAG_member
    1166        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$32)
    1167        .dwattr $C$DW$96, DW_AT_name("rsvd24")
    1168        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd24")
    1169        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1170        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1171        .dwattr $C$DW$96, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1172        .dwattr $C$DW$96, DW_AT_decl_line(0xbc)
    1173        .dwattr $C$DW$96, DW_AT_decl_column(0x0b)
    1174$C$DW$97        .dwtag  DW_TAG_member
    1175        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$56)
    1176        .dwattr $C$DW$97, DW_AT_name("$P$T9")
    1177        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T9")
    1178        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1179        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1180        .dwattr $C$DW$97, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1181        .dwattr $C$DW$97, DW_AT_decl_line(0xc0)
    1182        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1183$C$DW$98        .dwtag  DW_TAG_member
    1184        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$33)
    1185        .dwattr $C$DW$98, DW_AT_name("rsvd2c")
    1186        .dwattr $C$DW$98, DW_AT_TI_symbol_name("rsvd2c")
    1187        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1188        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1189        .dwattr $C$DW$98, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1190        .dwattr $C$DW$98, DW_AT_decl_line(0xcb)
    1191        .dwattr $C$DW$98, DW_AT_decl_column(0x0b)
    1192$C$DW$99        .dwtag  DW_TAG_member
    1193        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$58)
    1194        .dwattr $C$DW$99, DW_AT_name("$P$T10")
    1195        .dwattr $C$DW$99, DW_AT_TI_symbol_name("$P$T10")
    1196        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1197        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1198        .dwattr $C$DW$99, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1199        .dwattr $C$DW$99, DW_AT_decl_line(0xcf)
    1200        .dwattr $C$DW$99, DW_AT_decl_column(0x02)
    1201$C$DW$100       .dwtag  DW_TAG_member
    1202        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$60)
    1203        .dwattr $C$DW$100, DW_AT_name("$P$T11")
    1204        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T11")
    1205        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1206        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1207        .dwattr $C$DW$100, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1208        .dwattr $C$DW$100, DW_AT_decl_line(0xda)
    1209        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1210$C$DW$101       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   23

    1211        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$34)
    1212        .dwattr $C$DW$101, DW_AT_name("rsvd38")
    1213        .dwattr $C$DW$101, DW_AT_TI_symbol_name("rsvd38")
    1214        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1215        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1216        .dwattr $C$DW$101, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1217        .dwattr $C$DW$101, DW_AT_decl_line(0xe5)
    1218        .dwattr $C$DW$101, DW_AT_decl_column(0x0b)
    1219$C$DW$102       .dwtag  DW_TAG_member
    1220        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$62)
    1221        .dwattr $C$DW$102, DW_AT_name("$P$T12")
    1222        .dwattr $C$DW$102, DW_AT_TI_symbol_name("$P$T12")
    1223        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1224        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1225        .dwattr $C$DW$102, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1226        .dwattr $C$DW$102, DW_AT_decl_line(0xe8)
    1227        .dwattr $C$DW$102, DW_AT_decl_column(0x02)
    1228        .dwendtag $C$DW$T$35
    1229
    1230        .dwattr $C$DW$T$35, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1231        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1232        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1233$C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1234        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$35)
    1235        .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1236        .dwattr $C$DW$T$68, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1237        .dwattr $C$DW$T$68, DW_AT_decl_line(0xf0)
    1238        .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1239$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1240        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1241
    1242$C$DW$T$38      .dwtag  DW_TAG_union_type
    1243        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1244$C$DW$103       .dwtag  DW_TAG_member
    1245        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$36)
    1246        .dwattr $C$DW$103, DW_AT_name("REVID")
    1247        .dwattr $C$DW$103, DW_AT_TI_symbol_name("REVID")
    1248        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1250        .dwattr $C$DW$103, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1251        .dwattr $C$DW$103, DW_AT_decl_line(0x2a)
    1252        .dwattr $C$DW$103, DW_AT_decl_column(0x15)
    1253$C$DW$104       .dwtag  DW_TAG_member
    1254        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$37)
    1255        .dwattr $C$DW$104, DW_AT_name("REVID_bit")
    1256        .dwattr $C$DW$104, DW_AT_TI_symbol_name("REVID_bit")
    1257        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1259        .dwattr $C$DW$104, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1260        .dwattr $C$DW$104, DW_AT_decl_line(0x2e)
    1261        .dwattr $C$DW$104, DW_AT_decl_column(0x05)
    1262        .dwendtag $C$DW$T$38
    1263
    1264        .dwattr $C$DW$T$38, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1265        .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   24

    1266        .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    1267
    1268$C$DW$T$40      .dwtag  DW_TAG_union_type
    1269        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1270$C$DW$105       .dwtag  DW_TAG_member
    1271        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$36)
    1272        .dwattr $C$DW$105, DW_AT_name("SYSCFG")
    1273        .dwattr $C$DW$105, DW_AT_TI_symbol_name("SYSCFG")
    1274        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1276        .dwattr $C$DW$105, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1277        .dwattr $C$DW$105, DW_AT_decl_line(0x34)
    1278        .dwattr $C$DW$105, DW_AT_decl_column(0x15)
    1279$C$DW$106       .dwtag  DW_TAG_member
    1280        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$39)
    1281        .dwattr $C$DW$106, DW_AT_name("SYSCFG_bit")
    1282        .dwattr $C$DW$106, DW_AT_TI_symbol_name("SYSCFG_bit")
    1283        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1285        .dwattr $C$DW$106, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1286        .dwattr $C$DW$106, DW_AT_decl_line(0x3c)
    1287        .dwattr $C$DW$106, DW_AT_decl_column(0x05)
    1288        .dwendtag $C$DW$T$40
    1289
    1290        .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1291        .dwattr $C$DW$T$40, DW_AT_decl_line(0x33)
    1292        .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    1293
    1294$C$DW$T$42      .dwtag  DW_TAG_union_type
    1295        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1296$C$DW$107       .dwtag  DW_TAG_member
    1297        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$36)
    1298        .dwattr $C$DW$107, DW_AT_name("GPCFG0")
    1299        .dwattr $C$DW$107, DW_AT_TI_symbol_name("GPCFG0")
    1300        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1302        .dwattr $C$DW$107, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1303        .dwattr $C$DW$107, DW_AT_decl_line(0x42)
    1304        .dwattr $C$DW$107, DW_AT_decl_column(0x15)
    1305$C$DW$108       .dwtag  DW_TAG_member
    1306        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$41)
    1307        .dwattr $C$DW$108, DW_AT_name("GPCFG0_bit")
    1308        .dwattr $C$DW$108, DW_AT_TI_symbol_name("GPCFG0_bit")
    1309        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1310        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1311        .dwattr $C$DW$108, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1312        .dwattr $C$DW$108, DW_AT_decl_line(0x4f)
    1313        .dwattr $C$DW$108, DW_AT_decl_column(0x05)
    1314        .dwendtag $C$DW$T$42
    1315
    1316        .dwattr $C$DW$T$42, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1317        .dwattr $C$DW$T$42, DW_AT_decl_line(0x41)
    1318        .dwattr $C$DW$T$42, DW_AT_decl_column(0x08)
    1319
    1320$C$DW$T$44      .dwtag  DW_TAG_union_type
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   25

    1321        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1322$C$DW$109       .dwtag  DW_TAG_member
    1323        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$36)
    1324        .dwattr $C$DW$109, DW_AT_name("GPCFG1")
    1325        .dwattr $C$DW$109, DW_AT_TI_symbol_name("GPCFG1")
    1326        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1327        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1328        .dwattr $C$DW$109, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1329        .dwattr $C$DW$109, DW_AT_decl_line(0x55)
    1330        .dwattr $C$DW$109, DW_AT_decl_column(0x15)
    1331$C$DW$110       .dwtag  DW_TAG_member
    1332        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$43)
    1333        .dwattr $C$DW$110, DW_AT_name("GPCFG1_bit")
    1334        .dwattr $C$DW$110, DW_AT_TI_symbol_name("GPCFG1_bit")
    1335        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1336        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1337        .dwattr $C$DW$110, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1338        .dwattr $C$DW$110, DW_AT_decl_line(0x62)
    1339        .dwattr $C$DW$110, DW_AT_decl_column(0x05)
    1340        .dwendtag $C$DW$T$44
    1341
    1342        .dwattr $C$DW$T$44, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1343        .dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
    1344        .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    1345
    1346$C$DW$T$46      .dwtag  DW_TAG_union_type
    1347        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1348$C$DW$111       .dwtag  DW_TAG_member
    1349        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$36)
    1350        .dwattr $C$DW$111, DW_AT_name("CGR")
    1351        .dwattr $C$DW$111, DW_AT_TI_symbol_name("CGR")
    1352        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1354        .dwattr $C$DW$111, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1355        .dwattr $C$DW$111, DW_AT_decl_line(0x68)
    1356        .dwattr $C$DW$111, DW_AT_decl_column(0x15)
    1357$C$DW$112       .dwtag  DW_TAG_member
    1358        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$45)
    1359        .dwattr $C$DW$112, DW_AT_name("CGR_bit")
    1360        .dwattr $C$DW$112, DW_AT_TI_symbol_name("CGR_bit")
    1361        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1363        .dwattr $C$DW$112, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1364        .dwattr $C$DW$112, DW_AT_decl_line(0x7e)
    1365        .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    1366        .dwendtag $C$DW$T$46
    1367
    1368        .dwattr $C$DW$T$46, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1369        .dwattr $C$DW$T$46, DW_AT_decl_line(0x67)
    1370        .dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
    1371
    1372$C$DW$T$48      .dwtag  DW_TAG_union_type
    1373        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    1374$C$DW$113       .dwtag  DW_TAG_member
    1375        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$36)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   26

    1376        .dwattr $C$DW$113, DW_AT_name("ISRP")
    1377        .dwattr $C$DW$113, DW_AT_TI_symbol_name("ISRP")
    1378        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1380        .dwattr $C$DW$113, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1381        .dwattr $C$DW$113, DW_AT_decl_line(0x84)
    1382        .dwattr $C$DW$113, DW_AT_decl_column(0x15)
    1383$C$DW$114       .dwtag  DW_TAG_member
    1384        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$47)
    1385        .dwattr $C$DW$114, DW_AT_name("ISRP_bit")
    1386        .dwattr $C$DW$114, DW_AT_TI_symbol_name("ISRP_bit")
    1387        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1389        .dwattr $C$DW$114, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1390        .dwattr $C$DW$114, DW_AT_decl_line(0x8d)
    1391        .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    1392        .dwendtag $C$DW$T$48
    1393
    1394        .dwattr $C$DW$T$48, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1395        .dwattr $C$DW$T$48, DW_AT_decl_line(0x83)
    1396        .dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
    1397
    1398$C$DW$T$50      .dwtag  DW_TAG_union_type
    1399        .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1400$C$DW$115       .dwtag  DW_TAG_member
    1401        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$36)
    1402        .dwattr $C$DW$115, DW_AT_name("ISP")
    1403        .dwattr $C$DW$115, DW_AT_TI_symbol_name("ISP")
    1404        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1406        .dwattr $C$DW$115, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1407        .dwattr $C$DW$115, DW_AT_decl_line(0x93)
    1408        .dwattr $C$DW$115, DW_AT_decl_column(0x15)
    1409$C$DW$116       .dwtag  DW_TAG_member
    1410        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$49)
    1411        .dwattr $C$DW$116, DW_AT_name("ISP_bit")
    1412        .dwattr $C$DW$116, DW_AT_TI_symbol_name("ISP_bit")
    1413        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1415        .dwattr $C$DW$116, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1416        .dwattr $C$DW$116, DW_AT_decl_line(0x9c)
    1417        .dwattr $C$DW$116, DW_AT_decl_column(0x05)
    1418        .dwendtag $C$DW$T$50
    1419
    1420        .dwattr $C$DW$T$50, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1421        .dwattr $C$DW$T$50, DW_AT_decl_line(0x92)
    1422        .dwattr $C$DW$T$50, DW_AT_decl_column(0x08)
    1423
    1424$C$DW$T$52      .dwtag  DW_TAG_union_type
    1425        .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    1426$C$DW$117       .dwtag  DW_TAG_member
    1427        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$36)
    1428        .dwattr $C$DW$117, DW_AT_name("IESP")
    1429        .dwattr $C$DW$117, DW_AT_TI_symbol_name("IESP")
    1430        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   27

    1431        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1432        .dwattr $C$DW$117, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1433        .dwattr $C$DW$117, DW_AT_decl_line(0xa1)
    1434        .dwattr $C$DW$117, DW_AT_decl_column(0x15)
    1435$C$DW$118       .dwtag  DW_TAG_member
    1436        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$51)
    1437        .dwattr $C$DW$118, DW_AT_name("IESP_bit")
    1438        .dwattr $C$DW$118, DW_AT_TI_symbol_name("IESP_bit")
    1439        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1441        .dwattr $C$DW$118, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1442        .dwattr $C$DW$118, DW_AT_decl_line(0xaa)
    1443        .dwattr $C$DW$118, DW_AT_decl_column(0x05)
    1444        .dwendtag $C$DW$T$52
    1445
    1446        .dwattr $C$DW$T$52, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1447        .dwattr $C$DW$T$52, DW_AT_decl_line(0xa0)
    1448        .dwattr $C$DW$T$52, DW_AT_decl_column(0x08)
    1449
    1450$C$DW$T$54      .dwtag  DW_TAG_union_type
    1451        .dwattr $C$DW$T$54, DW_AT_byte_size(0x04)
    1452$C$DW$119       .dwtag  DW_TAG_member
    1453        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$36)
    1454        .dwattr $C$DW$119, DW_AT_name("IECP")
    1455        .dwattr $C$DW$119, DW_AT_TI_symbol_name("IECP")
    1456        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1458        .dwattr $C$DW$119, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1459        .dwattr $C$DW$119, DW_AT_decl_line(0xb0)
    1460        .dwattr $C$DW$119, DW_AT_decl_column(0x15)
    1461$C$DW$120       .dwtag  DW_TAG_member
    1462        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$53)
    1463        .dwattr $C$DW$120, DW_AT_name("IECP_bit")
    1464        .dwattr $C$DW$120, DW_AT_TI_symbol_name("IECP_bit")
    1465        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1467        .dwattr $C$DW$120, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1468        .dwattr $C$DW$120, DW_AT_decl_line(0xb8)
    1469        .dwattr $C$DW$120, DW_AT_decl_column(0x05)
    1470        .dwendtag $C$DW$T$54
    1471
    1472        .dwattr $C$DW$T$54, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1473        .dwattr $C$DW$T$54, DW_AT_decl_line(0xaf)
    1474        .dwattr $C$DW$T$54, DW_AT_decl_column(0x08)
    1475
    1476$C$DW$T$56      .dwtag  DW_TAG_union_type
    1477        .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    1478$C$DW$121       .dwtag  DW_TAG_member
    1479        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$36)
    1480        .dwattr $C$DW$121, DW_AT_name("PMAO")
    1481        .dwattr $C$DW$121, DW_AT_TI_symbol_name("PMAO")
    1482        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1484        .dwattr $C$DW$121, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1485        .dwattr $C$DW$121, DW_AT_decl_line(0xc1)
PRU Assembler Unix v2.1.2 Sat Oct 29 02:25:59 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   28

    1486        .dwattr $C$DW$121, DW_AT_decl_column(0x15)
    1487$C$DW$122       .dwtag  DW_TAG_member
    1488        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$55)
    1489        .dwattr $C$DW$122, DW_AT_name("PMAO_bit")
    1490        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PMAO_bit")
    1491        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1493        .dwattr $C$DW$122, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1494        .dwattr $C$DW$122, DW_AT_decl_line(0xc7)
    1495        .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    1496        .dwendtag $C$DW$T$56
    1497
    1498        .dwattr $C$DW$T$56, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1499        .dwattr $C$DW$T$56, DW_AT_decl_line(0xc0)
    1500        .dwattr $C$DW$T$56, DW_AT_decl_column(0x08)
    1501
    1502$C$DW$T$58      .dwtag  DW_TAG_union_type
    1503        .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    1504$C$DW$123       .dwtag  DW_TAG_member
    1505        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$36)
    1506        .dwattr $C$DW$123, DW_AT_name("IEPCLK")
    1507        .dwattr $C$DW$123, DW_AT_TI_symbol_name("IEPCLK")
    1508        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
